---
kind: type
id: T:Autodesk.Revit.DB.ExternallyTaggedBRep
source: html/58a208f6-2ce5-d6cf-d17e-f4968fae5b31.htm
---
# Autodesk.Revit.DB.ExternallyTaggedBRep

An ExternallyTaggedSolid can hold any shape created by BRepBuilder.

## Syntax (C#)
```csharp
public class ExternallyTaggedBRep : ExternallyTaggedGeometryObject
```